MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM381FWFG/mcu.h
/**
 *******************************************************************************
 * @file    TMPM381.h
 * @brief   CMSIS Cortex-M3 Core Peripheral Access Layer Header File for the
 *          TOSHIBA 'TMPM381' Device Series
 * @version V2.0.2.2 (Tentative)
 * @date    2015/04/23
 * 
 * DO NOT USE THIS SOFTWARE WITHOUT THE SOFTWARE LISENCE AGREEMENT.
 * 
 * (C)Copyright TOSHIBA CORPORATION 2015 All rights reserved
 *******************************************************************************
 */

/** @addtogroup TOSHIBA_TX03_MICROCONTROLLER
  * @{
  */
  
/** @addtogroup TMPM381
  * @{
  */

#ifndef __TMPM381_H__
#define __TMPM381_H__

#ifdef __cplusplus
extern "C" {
#endif

/** @addtogroup Configuration_of_CMSIS
  * @{
  */

/** Interrupt Number Definition */
typedef enum IRQn
{
/******  Cortex-M3 Processor Exceptions Numbers ***************************************************************/
  NonMaskableInt_IRQn           = -14,       /*!< 2 Non Maskable Interrupt                                    */
  HardFault_IRQn                = -13,       /*!< 3 Cortex-M3 Hard Fault Interrupt                            */
  MemoryManagement_IRQn         = -12,       /*!< 4 Cortex-M3 Memory Management Interrupt                     */
  BusFault_IRQn                 = -11,       /*!< 5 Cortex-M3 Bus Fault Interrupt                             */
  UsageFault_IRQn               = -10,       /*!< 6 Cortex-M3 Usage Fault Interrupt                           */
  SVCall_IRQn                   = -5,        /*!< 11 Cortex-M3 SV Call Interrupt                              */
  DebugMonitor_IRQn             = -4,        /*!< 12 Cortex-M3 Debug Monitor Interrupt                        */
  PendSV_IRQn                   = -2,        /*!< 14 Cortex-M3 Pend SV Interrupt                              */
  SysTick_IRQn                  = -1,        /*!< 15 Cortex-M3 System Tick Interrupt                          */

/******  TMPM381 Specific Interrupt Numbers *******************************************************************/
  INT0_IRQn                     = 0,         /*!< Interrupt pin (PH0/AIN0/INT0)                               */
  INT1_IRQn                     = 1,         /*!< Interrupt pin (PH1/AIN1/INT1)                               */
  INT2_IRQn                     = 2,         /*!< Interrupt pin (PH2/AIN2/INT2)                               */
  INT3_IRQn                     = 3,         /*!< Interrupt pin (PA0/TB0IN/INT3)                              */
  INT4_IRQn                     = 4,         /*!< Interrupt pin (PA2/TB1IN/INT4)                              */
  INT5_IRQn                     = 5,         /*!< Interrupt pin (PE4/TB2IN/INT5)                              */
  INTRX0_IRQn                   = 6,         /*!< Serial reception (channel.0)                                */
  INTTX0_IRQn                   = 7,         /*!< Serial transmission (channel.0)                             */
  INTRX1_IRQn                   = 8,         /*!< Serial reception (channel.1)                                */
  INTTX1_IRQn                   = 9,         /*!< Serial transmission (channel.1)                             */
  INTSSP0_IRQn                  = 10,        /*!< Syncronous Serial Port 0                                    */
  INTSBI0_IRQn                  = 14,        /*!< Serial Bus Interface 0 interrupt                            */
  INTRTC_IRQn                   = 17,        /*!< Realtime clock interrupt                                    */
  INTRMCRX_IRQn                 = 19,        /*!< Remote Controller reception interrupt                       */
  INTTB00_IRQn                  = 20,        /*!< 16bit TMRB0 compare match detection 0                       */
  INTTB01_IRQn                  = 21,        /*!< 16bit TMRB0 compare match detection 1                       */
  INTTB10_IRQn                  = 22,        /*!< 16bit TMRB1 compare match detection 0                       */
  INTTB11_IRQn                  = 23,        /*!< 16bit TMRB1 compare match detection 1                       */
  INTTB40_IRQn                  = 24,        /*!< 16bit TMRB4 compare match detection 0                       */
  INTTB41_IRQn                  = 25,        /*!< 16bit TMRB4 compare match detection 1                       */
  INTTB50_IRQn                  = 26,        /*!< 16bit TMRB5 compare match detection 0                       */
  INTTB51_IRQn                  = 27,        /*!< 16bit TMRB5 compare match detection 1                       */
  INTCAP00_IRQn                 = 30,        /*!< 16bit TMRB0 input capture 0                                 */
  INTCAP01_IRQn                 = 31,        /*!< 16bit TMRB0 input capture 1                                 */
  INTCAP10_IRQn                 = 32,        /*!< 16bit TMRB1 input capture 0                                 */
  INTCAP11_IRQn                 = 33,        /*!< 16bit TMRB1 input capture 1                                 */
  INTCAP40_IRQn                 = 34,        /*!< 16bit TMRB4 input capture 0                                 */
  INTCAP41_IRQn                 = 35,        /*!< 16bit TMRB4 input capture 1                                 */
  INTCAP50_IRQn                 = 36,        /*!< 16bit TMRB5 input capture 0                                 */
  INTCAP51_IRQn                 = 37,        /*!< 16bit TMRB5 input capture 1                                 */
  INT6_IRQn                     = 38,        /*!< Interrupt Pin (PE6/TB3IN/INT6)                              */
  INT7_IRQn                     = 39,        /*!< Interrupt Pin (PE7/TB3OUT/INT7)                             */
  INTRX2_IRQn                   = 40,        /*!< Serial reception (channel.2)                                */
  INTTX2_IRQn                   = 41,        /*!< Serial transmit (channel.2)                                 */
  INTADCP0_IRQn                 = 42,        /*!< ADC conversion monitoring function interrupt 0              */
  INTADCP1_IRQn                 = 43,        /*!< ADC conversion monitoring function interrupt 1              */
  INTUART0_IRQn                 = 44,        /*!< UART transmission and reception interrupt (channel.0)       */
  INTTB20_IRQn                  = 46,        /*!< 16bit TMRB2 compare match detection 0                       */
  INTTB21_IRQn                  = 47,        /*!< 16bit TMRB2 compare match detection 1                       */
  INTTB30_IRQn                  = 48,        /*!< 16bit TMRB3 compare match detection 0                       */
  INTTB31_IRQn                  = 49,        /*!< 16bit TMRB3 compare match detection 1                       */
  INTCAP20_IRQn                 = 50,        /*!< 16bit TMRB2 input capture 0                                 */
  INTCAP21_IRQn                 = 51,        /*!< 16bit TMRB2 input capture 1                                 */
  INTCAP30_IRQn                 = 52,        /*!< 16bit TMRB3 input capture 0                                 */
  INTCAP31_IRQn                 = 53,        /*!< 16bit TMRB3 input capture 1                                 */
  INTADSFT_IRQn                 = 54,        /*!< ADC conversion started by software is finished              */
  INTADTMR_IRQn                 = 56,        /*!< ADC conversion triggered by timer is finished               */
  INT8_IRQn                     = 58,        /*!< Interrupt Pin (PA7/TB4IN/INT8)                              */
  INT9_IRQn                     = 59,        /*!< Interrupt Pin (PD3/INT9)                                    */
  INTA_IRQn                     = 60,        /*!< Interrupt Pin (PJ6/AIN6/INTA)                               */
  INTB_IRQn                     = 61,        /*!< Interrupt Pin (PJ7/AIN7/INTB)                               */
  INTTB60_IRQn                  = 66,        /*!< 16bit TMRB6 compare match detection 0                       */
  INTTB61_IRQn                  = 67,        /*!< 16bit TMRB6 compare match detection 1                       */
  INTTB70_IRQn                  = 68,        /*!< 16bit TMRB7 compare match detection 0                       */
  INTTB71_IRQn                  = 69,        /*!< 16bit TMRB7 compare match detection 1                       */
  INTCAP60_IRQn                 = 70,        /*!< 16bit TMRB6 input capture 0                                 */
  INTCAP61_IRQn                 = 71,        /*!< 16bit TMRB6 input capture 1                                 */
  INTCAP70_IRQn                 = 72,        /*!< 16bit TMRB7 input capture 0                                 */
  INTCAP71_IRQn                 = 73,        /*!< 16bit TMRB7 input capture 1                                 */
  INTC_IRQn                     = 74,        /*!< Interrupt Pin (PD0/TB5IN/INTC)                              */
  INTD_IRQn                     = 75,        /*!< Interrupt Pin (PD2/INTD)                                    */
  INTE_IRQn                     = 76,        /*!< Interrupt Pin (PN7/INTE)                                    */
  INTF_IRQn                     = 77         /*!< Interrupt Pin (PL2/INTF)                                    */
} IRQn_Type;

